{
  "https://example.com": {
    "summary": "Summary:\n\nThis domain is an example domain used for documentation purposes. \n\nKey information:\n- Purpose: Documentation examples\n- Permission: No permission required\n- Warning: Avoid using in operations",
    "timestamp": 1763845299.0763369,
    "original_length": 142,
    "summary_length": 202
  },
  "https://timesofindia.indiatimes.com/city/mumbai/mumbai-fire-breaks-out-in-borivli-no-one-injured/articleshow/125510035.cms": {
    "summary": "A fire broke out at Ganpat Patil Nagar in Borivli, Mumbai, on November 22, 2025, at 5:29 pm. The blaze, covering 500 x 150 sq ft across 8-10 galas, was confined to electric wiring, wooden furniture, and other materials. The fire was brought under control and extinguished by 8:40 pm, with no reported injuries.",
    "timestamp": 1763848350.7356074,
    "original_length": 11796,
    "summary_length": 310
  },
  "https://mu.ac.in/old/examination.html": {
    "summary": "Here's a summary of the content:\n\n* Examination forms for Winter 2025 (SH 2025) and Summer 2025 (FH 2025) exams are available.\n* Circulars have been issued for the implementation of NEP-2020 Examination and Evaluation Guidelines for UG Programs (Arts, Science, Commerce & Management) Semesters I to II.\n* The Centre for Distance & Online Education (CDOE) examinations have been rescheduled.\n* UG NEP (Semester I-KT) and UG NEP (Semester II-Regular) examinations will be held as per revised dates.\n* The statement of the balance stock of blank OSM cum bar-coded answer books of 32 page & 8 page (Pink Colour) and stationary is available.\n* The dates for issue and return of examination forms for various courses are mentioned.\n* The dates for the distribution and collection of examination materials, such as question papers and answer sheets, are also mentioned.\n* The last dates for submission of examination forms for various courses are December 4, 2024, for the winter session and February 2025 for the summer session.\n* The University of Mumbai has issued various circulars and notifications regarding the examination process, evaluation guidelines, and other important dates.",
    "timestamp": 1764269038.3736541,
    "original_length": 74223,
    "summary_length": 1181
  },
  "https://timesofindia.indiatimes.com/india/karnataka-cm-tussle-cong-high-command-cracks-whip-sidda-invites-dks-for-breakfast-meet/articleshow/125640900.cms": {
    "summary": "Karnataka CM tussle: Congress high command intervenes. Key points:\n\n- November 28, 2025: Karnataka Chief Minister Siddaramaiah invites Deputy CM D.K. Shivakumar for breakfast at the direction of the party high command.\n- The meeting is aimed at discussing the \"power tussle\" over the chief ministerial post, which has been ongoing since the Congress government reached its halfway mark.\n- The party high command has asked Siddaramaiah and Shivakumar to meet, with both leaders stating they will obey the command.\n- This comes amid a tug-of-war between Siddaramaiah and DKS over the CM post, with DKS's faction reportedly pushing for a leadership transition.\n- The Congress government completed 2.5 years in power, prompting speculation about a leadership change.\n- DKS claimed there was a \"confidential understanding on leadership transition\" among top leaders after the 2023 elections.",
    "timestamp": 1764355457.0057466,
    "original_length": 15141,
    "summary_length": 886
  },
  "https://www.hindustantimes.com/india-news/cyclone-ditwah-when-will-the-storm-make-landfall-imd-issues-update-5-states-on-alert-101764304106310.html": {
    "summary": "Cyclone Ditwah is moving north-northwest over Sri Lanka and the Bay of Bengal. Key updates include:\n\n- The storm is expected to approach Tamil Nadu and south Andhra Pradesh by November 30.\n- As of November 28, 5:30 am IST, the storm was positioned at 8.2 degrees North, 81.1 degrees East, roughly 50 km south-southwest of Trincomalee.\n- The storm is advancing at a speed of 7 kmph.\n- The system is expected to trigger heavy to very heavy rain across southern India from November 28 to December 2.\n- Five states are on alert, with Tamil Nadu, south Andhra Pradesh, Puducherry, and four districts of Tamil Nadu under a red alert.",
    "timestamp": 1764367851.447145,
    "original_length": 8785,
    "summary_length": 627
  },
  "https://www.thehindu.com/news/national/karnataka/siddaramaiah-dk-shivakumar-to-meet-on-november-29/article70335783.ece": {
    "summary": "Key entities: \n- Siddaramaiah (Karnataka Chief Minister)\n- D.K. Shivakumar (Karnataka Deputy Chief Minister)\n- The Congress (Indian National Congress)\n- BJP (Bharatiya Janata Party)\n- JD(S) (Janaadhipathya Janata Paksha)\n- Karnataka\n- Belagavi\n\nImportant dates:\n- November 28, 2025\n- November 29, 2025 (breakfast meeting between Siddaramaiah and Shivakumar)\n- December 1, 2025 (Winter Session of Parliament begins)\n- December 8, 2025 (Winter Session of State legislature session in Belagavi)\n\nSummary:\nSiddaramaiah and D.K. Shivakumar, leaders involved in a leadership battle within the Congress party, have agreed to a breakfast meeting on November 29. This comes after the high command instructed them to hold a meeting to control damage to the party and government ahead of the State legislature session. The meeting aims to send a message to rival parties (BJP and JD(S)) that the ruling dispensation is stable.",
    "timestamp": 1764382816.298445,
    "original_length": 3532,
    "summary_length": 915
  }
}